Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: The above code verifies that `val1` is less than, or approximately equal to, `val2`.
it_it: Il codice precedente controlla che `val1` sia inferiore o approssimativamente uguale a `val2`.

source: The above code will fail with error:
it_it: Il codice precedente fallirà con errore:

source: The above configuration declares a dependency on GoogleTest which is downloaded as a ZIP archive from GitHub.
it_it: La configurazione precedente dichiara una dipendenza da GoogleTest che viene scaricato come archivio ZIP da GitHub.

source: The above configuration declares a dependency on GoogleTest which is downloaded from GitHub.
it_it: La configurazione precedente dichiara una dipendenza da GoogleTest che viene scaricato da GitHub.

source: The above configuration enables testing in CMake, declares the C++ test binary you want to build (hello_test), and links it to GoogleTest (gtest_main).
it_it: La configurazione precedente abilita il test in CMake, dichiara il file binario di test C++ che si desidera buildare (hello_test) e lo "linka" a GoogleTest (gtest_main).

source: The above configuration enables testing in CMake, declares the C++ test binary you want to build (`hello_test`), and links it to GoogleTest (`gtest_main`).
it_it: La configurazione precedente abilita il test in CMake, dichiara il file binario di test C++ che si desidera buildare (`hello_test`) e lo "linka" a GoogleTest (`gtest_main`).

source: The above matcher says that the container must have 4 elements, which must be 1, greater than 0, anything, and 5 respectively.
it_it: Il matcher sopra dice che il container deve avere 4 elementi, che devono essere rispettivamente 1, maggiore di 0, qualsiasi cosa e 5.

source: The above matchers use ULP-based comparison (the same as used in googletest).
it_it: I matcher precedenti utilizzano il confronto basato su ULP (lo stesso utilizzato in googletest).

source: The above sample includes the main GoogleTest header file and demonstrates some basic assertions.
it_it: L'esempio precedente include il file header principale di GoogleTest e mostra alcune asserzioni di base.

source: The above steps are repeated on another QueueTest object, this time running the DequeueWorks test.
it_it: I passaggi precedenti vengono ripetuti su un altro oggetto QueueTest, questa volta eseguendo il test DequeueWorks.

source: The above steps are repeated on another `QueueTest` object, this time running the `DequeueWorks` test.
it_it: I passaggi precedenti vengono ripetuti su un altro oggetto `QueueTest`, questa volta eseguendo il test `DequeueWorks`.

source: The above uses both ASSERT_* and EXPECT_* assertions.
it_it: Quanto sopra utilizza entrambe le asserzioni ASSERT_* e EXPECT_*.

source: The above uses both `ASSERT_*` and `EXPECT_*` assertions.
it_it: Quanto sopra utilizza entrambe le asserzioni `ASSERT_*` e `EXPECT_*`.

source: The abstract class that all tests inherit from.
it_it: La classe astratta da cui ereditano tutti i test.

source: The action does not take ownership of the elements in the source range.
it_it: L'azione non assume la proprietà degli elementi nell'intervallo di origine.

source: The action specified by WillByDefault is superseded by the actions specified on a matching EXPECT_CALL statement, if any.
it_it: La action specificata da WillByDefault viene sostituita dalle action specificate in un'istruzione EXPECT_CALL corrispondente, se presente.

source: The action specified by `WillByDefault` is superseded by the actions specified on a matching `EXPECT_CALL` statement, if any.
it_it: La action specificata da `WillByDefault` viene sostituita dalle action specificate in un'istruzione `EXPECT_CALL` corrispondente, se presente.

source: The action takes ownership of the callback and will delete it when the action itself is destructed.
it_it: L'azione assume la proprietà [ownership] della callback e la eliminerà [delete] quando l'azione stessa verrà distrutta.

source: The actual contents of the file are not important at this time, although we may put some useful information in it in the future.
it_it: Il contenuto effettivo del file non è importante al momento, anche se potremmo inserirvi alcune informazioni utili in futuro.

source: The answer is ... yes!
it_it: La risposta è ... sì!

source: The answer is that ASSERT_EQ and related macros may or may not work, and it's smarter to use the macros specifically meant for floating point comparisons.
it_it: La risposta è che ASSERT_EQ e le macro correlate potrebbero funzionare o meno, ed è più intelligente utilizzare le macro specificatamente pensate per i confronti in virgola mobile.

source: The answer is that it was necessary for technical reasons.) If the method is not overloaded, the macro can also be called without matchers:
it_it: La risposta è che era necessario per motivi tecnici). Se il metodo non è overloaded, la macro può essere richiamata anche senza i matcher:

source: The answer is that they work normally, although some actions will not compile when any of method's arguments are move-only.
it_it: La risposta è che funzionano normalmente, anche se alcune azioni non verranno compilate quando uno qualsiasi degli argomenti del metodo è move-only.

source: The answer lies in *what* a test should verify.
it_it: La risposta sta in *cosa* dovrebbe verificare un test.

source: The answer lies in what a test should verify.
it_it: La risposta sta in cosa dovrebbe verificare un test.

source: The argument *`InstantiationName`* is a unique name for the instantiation of the test suite, to distinguish between multiple instantiations.
it_it: L'argomento *`InstantiationName`* è un nome univoco per l'istanziazione della test suite, per distinguere tra più istanze.

source: The argument *`TestFixtureName`* is a fixture class template, parameterized by a type, for example:
it_it: L'argomento *`TestFixtureName`* è una classe fixture template, parametrizzata da un tipo, per esempio:

source: The argument *`TestFixtureName`* is a fixture class template, parameterized by a type.
it_it: L'argomento *`TestFixtureName`* è una classe fixture template, parametrizzata da un tipo.

source: The argument *`Types`* is a [`Types`](#Types) object representing the list of types to run the tests on, for example:
it_it: L'argomento *`Types`* è un oggetto [`Types`](#Types) che rappresenta l'elenco dei tipi su cui eseguire i test, ad esempio:

source: The argument *`param_generator`* is one of the following GoogleTest-provided functions that generate the test parameters, all defined in the `::testing` namespace:
it_it: L'argomento *`param_generator`* è una delle seguenti funzioni fornite da GoogleTest che generano i parametri di test, tutti definiti nel namespace `::testing` namespace:

source: The argument InstantiationName is a unique name for the instantiation of the test suite, to distinguish between multiple instantiations.
it_it: L'argomento InstantiationName è un nome univoco per l'istanziazione della test suite, per distinguere tra più istanze.

source: The argument TestFixtureName is a fixture class template, parameterized by a type, for example:
it_it: L'argomento TestFixtureName è una classe fixture template, parametrizzata da un tipo, per esempio:

source: The argument TestFixtureName is a fixture class template, parameterized by a type.
it_it: L'argomento TestFixtureName è una classe fixture template, parametrizzata da un tipo.

source: The argument Types is a Types object representing the list of types to run the tests on, for example:
it_it: L'argomento Types è un oggetto Types che rappresenta l'elenco dei tipi su cui eseguire i test, ad esempio:

source: The argument param_generator is one of the following GoogleTest-provided functions that generate the test parameters, all defined in the ::testing namespace:
it_it: L'argomento param_generator è una delle seguenti funzioni fornite da GoogleTest che generano i parametri di test, tutti definiti nel namespace ::testing:

source: The argument-less InitGoogleTest() overload can be used on Arduino/embedded platforms where there is no argc/argv.
it_it: L'overload senza argomenti, InitGoogleTest() è utilizzabile su piattaforme Arduino/embedded dove non è presente argc/argv.

source: The argument-less `InitGoogleTest()` overload can be used on Arduino/embedded platforms where there is no `argc`/`argv`.
it_it: L'overload senza argomenti, `InitGoogleTest()` è utilizzabile su piattaforme Arduino/embedded dove non è presente `argc`/`argv`.

source: The array being matched may be multi-dimensional (i.e. its elements can be arrays).
it_it: L'array da abbinare può essere multidimensionale (ovvero i suoi elementi possono essere array).

source: The assertions come in pairs that test the same thing but have different effects on the current function.
it_it: Le asserzioni si presentano in coppie che mettono alla prova la stessa cosa ma hanno effetti diversi sulla funzione corrente.

source: The assertions in this section generate a success or failure directly instead of testing a value or expression.
it_it: Le asserzioni in questa sezione generano direttamente un successo o un fallimento invece di testare un valore o un'espressione.

source: The automated testing framework does not set the style flag.
it_it: Il framework di test automatizzato non imposta il flag dello stile.

source: The challenge is to verify that your testing utility reports failures correctly.
it_it: La sfida consiste nel verificare che l'utilità di test riporti correttamente gli errori.

source: The choice is left to you, the user.
it_it: La scelta è lasciata all'utente.

source: The code under test calls methods of foo.
it_it: Il codice da testare chiama i metodi di foo.

source: The code under test calls methods of `foo`.
it_it: Il codice da testare chiama i metodi di `foo`.

source: The code won't compile if any of these conditions isn't met.
it_it: Il codice non verrà compilato se una di queste condizioni non viene soddisfatta.

source: The compiler complains "no matching function to call" when I use ASSERT_PRED*.
it_it: Il compilatore dice "no matching function to call" quando si usa ASSERT_PRED*.

source: The compiler complains "no matching function to call" when I use `ASSERT_PRED*`.
it_it: Il compilatore dice "no matching function to call" quando si usa `ASSERT_PRED*`.

source: The compiler complains about "undefined references" to some static const member variables, but I did define them in the class body.
it_it: Il compilatore si lamenta di "riferimenti non definiti" ad alcune variabili membro const statiche, ma sono state definite nel corpo della classe.

source: The compiler complains about no match for 'operator<<' when I use an assertion.
it_it: Il compilatore dice no match for 'operator<<' quando si usa un'asserzione.

source: The compiler complains about `no match for 'operator<<'` when I use an assertion.
it_it: Il compilatore dice `no match for 'operator<<'` quando si usa un'asserzione.

source: The compiler will still match them up.
it_it: Il compilatore li abbinerà comunque.

source: The console output includes the random seed value, such that you can reproduce an order-related test failure later.
it_it: L'output della console include il valore di inizializzazione casuale, in modo da poter riprodurre successivamente un errore relativo all'ordine.

source: The details can be found [here](gmock_cook_book.md#OrderedCalls).)
it_it: I dettagli si trovano [qui](gmock_cook_book.md#OrderedCalls).)

source: The difference between fakes and mocks shall become much clearer once you start to use mocks.
it_it: La differenza tra i fake e i mock diventerà molto più chiara una volta che si inizia ad usare utilizzare i mock.

source: The difference between the two is that OnceAction has weaker requirements (Action requires a copy-constructible input that can be called repeatedly whereas OnceAction requires only move-constructible and supports &&-qualified call operators), but can be used only with WillOnce.
it_it: La differenza tra i due è che OnceAction ha requisiti più deboli (Action richiede un input con costruttore-copia che può essere chiamato ripetutamente mentre OnceAction richiede un costruttore-move e supporta operatori di chiamata qualificati &&), ma può essere utilizzato solo con WillOnce.

source: The difference between the two is that `OnceAction` has weaker requirements (`Action` requires a copy-constructible input that can be called repeatedly whereas `OnceAction` requires only move-constructible and supports `&&`-qualified call operators), but can be used only with `WillOnce`.
it_it: La differenza tra i due è che `OnceAction` ha requisiti più deboli (`Action` richiede un input con costruttore-copia che può essere chiamato ripetutamente mentre `OnceAction` richiede un costruttore-move e supporta operatori di chiamata qualificati `&&`), ma può essere utilizzato solo con `WillOnce`.

source: The difference is that MatcherCast works as long as you can static_cast type T to type U.
it_it: La differenza è che MatcherCast funziona finquando si può eseguire lo static_cast del tipo T nel tipo U.

source: The difference is that `MatcherCast` works as long as you can `static_cast` type `T` to type `U`.
it_it: La differenza è che `MatcherCast` funziona fin quando si può eseguire lo `static_cast` del tipo `T` nel tipo `U`.

source: The difference?
it_it: La differenza?

source: The downside is that wrapping the action in WithArgs<...>() can get tedious for people writing the tests.
it_it: Lo svantaggio è che racchiudere l'azione in WithArgs<...>() può diventare noioso per le persone che scrivono i test.

source: The downside is that wrapping the action in `WithArgs<...>()` can get tedious for people writing the tests.
it_it: Lo svantaggio è che racchiudere l'azione in `WithArgs<...>()` può diventare noioso per le persone che scrivono i test.

source: The easiest way to avoid this is to use the _CrtMemCheckpoint and _CrtMemDumpAllObjectsSince calls to not report any statically initialized heap objects.
it_it: Il modo più semplice per evitare ciò è utilizzare le chiamate _CrtMemCheckpoint e _CrtMemDumpAllObjectsSince per non riportare alcun oggetto heap inizializzato staticamente.

source: The easiest way to avoid this is to use the `_CrtMemCheckpoint` and `_CrtMemDumpAllObjectsSince` calls to not report any statically initialized heap objects.
it_it: Il modo più semplice per evitare ciò è utilizzare le chiamate `_CrtMemCheckpoint` e `_CrtMemDumpAllObjectsSince` per non riportare alcun oggetto heap inizializzato staticamente.

source: The effect will be undone when the control leaves the current lexical scope.
it_it: L'effetto verrà annullato quando il controllo lascerà lo scope lessicale corrente.

source: The effect is undone with the destruction of the instance.
it_it: L'effetto viene annullato con la distruzione dell'istanza.

source: The events you can listen to include the start and end of the test program, a test suite, or a test method, among others.
it_it: Gli eventi che si possono rilevare [listen] includono, tra gli altri, l'inizio e la fine del programma di test, di una test suite o di un metodo di test.

source: The expectation spec says that the first Bar("a") call must happen before checkpoint "1", the second Bar("a") call must happen after checkpoint "2", and nothing should happen between the two checkpoints.
it_it: La specifica della expectation dice che la prima chiamata Bar("a") deve avvenire prima del checkpoint "1", la seconda chiamata Bar("a") deve avvenire dopo il checkpoint "2", e tra i due checkpoint non dovrebbe succedere nulla.

source: The expectation spec says that the first `Bar("a")` call must happen before checkpoint "1", the second `Bar("a")` call must happen after checkpoint "2", and nothing should happen between the two checkpoints.
it_it: La specifica della expectation dice che la prima chiamata `Bar("a")` deve avvenire prima del checkpoint "1", la seconda chiamata `Bar("a")` deve avvenire dopo il checkpoint "2", e tra i due checkpoint non dovrebbe succedere nulla.

source: The expectation will apply only to calls of method_name whose arguments match all of the matchers.
it_it: La expectation si applicherà solo alle chiamate di method_name i cui argomenti corrispondono a tutti i matcher.

source: The expectation will *retire* (no longer match any function calls) after it has been *saturated* (the upper bound has been reached).
it_it: La expectation verrà *retire* (pensionata) (non corrisponderà più ad alcuna chiamata di funzione) dopo essere stata *saturata* (il limite superiore è stato raggiunto).

source: The expectation will retire (no longer match any function calls) after it has been saturated (the upper bound has been reached).
it_it: La expectation verrà retire (ritirata) (non corrisponderà più ad alcuna chiamata di funzione) dopo essere stata saturata (il limite superiore è stato raggiunto).

source: The expectation will apply only to calls of *`method_name`* whose arguments match all of the matchers.
it_it: La expectation si applicherà solo alle chiamate di *`method_name`* i cui argomenti corrispondono a tutti i matcher.

source: The explicit checkpoints make it clear which Bar("a") is called by which call to Foo().
it_it: I checkpoint espliciti chiariscono quale Bar("a") viene chiamata da quale chiamata a Foo().

source: The explicit checkpoints make it clear which `Bar("a")` is called by which call to `Foo()`.
it_it: I checkpoint espliciti chiariscono quale `Bar("a")` viene chiamata da quale chiamata a `Foo()`.

source: The expression inside With() must be a matcher of type Matcher<std::tuple<A1, ..., An>>, where A1, ..., An are the types of the function arguments.
it_it: L'espressione in With() dev'essere un matcher del tipo Matcher<std::tuple<A1, ..., An>>, dove A1, ..., An sono i tipi degli argomenti della funzione.

source: The expression inside `With()` must be a matcher of type `Matcher<std::tuple<A1, ..., An>>`, where `A1`, ..., `An` are the types of the function arguments.
it_it: L'espressione in `With()` dev'essere un matcher del tipo `Matcher<std::tuple<A1, ..., An>>`, dove `A1`, ..., `An` sono i tipi degli argomenti della funzione.

source: The fact that "it used to work" doesn't mean it's valid.
it_it: Il fatto che "funzionava" non significa che sia valido.

source: The fact they are the same *is* interesting information.
it_it: Il fatto che siano la stessa cosa *è* un'informazione interessante.

source: The fact they are the same is interesting information.
it_it: Il fatto che siano la stessa cosa è un'informazione interessante.

source: The first argument of the macro is the test suite name; the rest are the names of the tests in this test suite:
it_it: Il primo argomento della macro è il nome della test suite; il resto sono i nomi dei test in questa test suite:

source: The first 3 parameters are simply the method declaration, split into 3 parts.
it_it: I primi 3 parametri sono semplicemente la dichiarazione del metodo, divisa in 3 parti.

source: The first n - 1 sub-actions must return void and will receive a readonly view of the arguments.
it_it: Le prime n - 1 sotto-azioni devono restituire void e riceveranno una vista di sola lettura degli argomenti.

source: The first `n - 1` sub-actions must return void and will receive a readonly view of the arguments.
it_it: Le prime `n - 1` sotto-azioni devono restituire void e riceveranno una vista di sola lettura degli argomenti.

source: The first argument to INSTANTIATE_TEST_SUITE_P is a unique name for the instantiation of the test suite.
it_it: Il primo argomento di INSTANTIATE_TEST_SUITE_P è un nome univoco per l'istanziazione della test suite.

source: The first argument to `INSTANTIATE_TEST_SUITE_P` is a unique name for the instantiation of the test suite.
it_it: Il primo argomento di `INSTANTIATE_TEST_SUITE_P` è un nome univoco per l'istanziazione della test suite.

source: The first clause we can specify following an EXPECT_CALL() is Times().
it_it: La prima clausola che possiamo specificare dopo una EXPECT_CALL() è Times().

source: The first clause we can specify following an `EXPECT_CALL()` is `Times()`.
it_it: La prima clausola che possiamo specificare dopo una `EXPECT_CALL()` è `Times()`.

source: The first step is to define an implementation class:
it_it: Il primo passo è definire una classe di implementazione:

source: The first test (IsEmptyInitially) runs on t1.
it_it: Il primo test (IsEmptyInitially) viene eseguito su t1.

source: The first test (`IsEmptyInitially`) runs on `t1`.
it_it: Il primo test (`IsEmptyInitially`) viene eseguito su `t1`.

source: The first thing to remember is that GoogleTest does **not** reuse the same test fixture object across multiple tests.
it_it: La prima cosa da ricordare è che that GoogleTest **non** riutilizza lo stesso oggetto test fixture in più test.

source: The first thing to remember is that GoogleTest does not reuse the same test fixture object across multiple tests.
it_it: La prima cosa da ricordare è che that GoogleTest non riutilizza lo stesso oggetto fixture in più test.

source: The first time this method is called, a UnitTest object is constructed and returned.
it_it: La prima volta che viene chiamato questo metodo, viene costruito e restituito un oggetto UnitTest.

source: The first time this method is called, a `UnitTest` object is constructed and returned.
it_it: La prima volta che viene chiamato questo metodo, viene costruito e restituito un oggetto `UnitTest`.

source: The first time you create a thread, a manager thread is created in addition, so you get 3, not 2, threads.
it_it: La prima volta che si crea un thread, viene creato in aggiunta un thread di gestione, quindi si hanno 3 thread, non 2.

source: The fixture class is derived from the ::testing::test class declared in gtest.h.
it_it: La classe fixture deriva dalla classe ::testing::test dichiarata in gtest.h.

source: The following argument types are used:
it_it: Vengono utilizzati i seguenti tipi di argomento:

source: The following assertion allows matchers to be used to verify values.
it_it: La seguente asserzione consente di utilizzare i matcher per verificare i valori.

source: The following assertion allows [matchers](matchers.md) to be used to verify values.
it_it: La seguente asserzione consente di utilizzare i [matcher](matchers.md) per verificare i valori.

source: The following assertions compare two **C strings**.
it_it: Le seguenti asserzioni confrontano due **stringhe C**.

source: The following assertions compare two C strings.
it_it: Le seguenti asserzioni confrontano due stringhe C.

source: The following assertions compare two floating-point values.
it_it: Le seguenti asserzioni confrontano due valori a virgola mobile.

source: The following assertions compare two values.
it_it: Le seguenti asserzioni confrontano due valori.

source: The following assertions enable more complex predicates to be verified while printing a more clear failure message than if EXPECT_TRUE were used alone.
it_it: Le seguenti affermazioni consentono di verificare predicati più complessi e stampano un messaggio di errore più chiaro rispetto a quando si usa il solo EXPECT_TRUE.

source: The following assertions enable more complex predicates to be verified while printing a more clear failure message than if `EXPECT_TRUE` were used alone.
it_it: Le seguenti affermazioni consentono di verificare predicati più complessi e stampano un messaggio di errore più chiaro rispetto a quando si usa il solo `EXPECT_TRUE`.

source: The following assertions test Boolean conditions.
it_it: Le seguenti asserzioni verificano le condizioni Booleane.

source: The following assertions test for HRESULT success or failure.
it_it: Le seguenti asserzioni verificano il successo o il fallimento di HRESULT.
